# Intro to pandas Library

The pandas library consist of ttwo data types:
    Series
    DataFrames: A 2D object to represent `tabular` data

## DataFrames Characteristics

- Mutable
- Index based
- A full class

### Classic data representation formats
- JSON
- CSV

In [1]:
import pandas as pd

In [3]:
df_one = pd.DataFrame(columns = ['Column1', 'Column2'])
df_one

Empty DataFrame
Columns: [Column1, Column2]
Index: []

In [5]:
# another way
df_one.columns = ['First', 'Second']
df_one

Empty DataFrame
Columns: [First, Second]
Index: []

In [10]:
# add some rows
data1 = {
    'First': [1,2, 'Real'],
    'Second': [33,55, 'Madrid']
    }
data2 = {'First': [4,4, 'Coke'],
    'Second': [5,6, 'Apple']
    }

In [11]:
df_one = pd.DataFrame(data1)
df_two = pd.DataFrame(data2)

df_3 = pd.concat([df_one, df_two])
df_3

  First  Second
0     1      33
1     2      55
2  Real  Madrid
0     4       5
1     4       6
2  Coke   Apple

In [13]:
df_3.reset_index(drop=True, inplace=True)
df_3

  First  Second
0     1      33
1     2      55
2  Real  Madrid
3     4       5
4     4       6
5  Coke   Apple

In [15]:
col_data = {
    'Third' : [55,99,11]
}
df_4 = pd.DataFrame(col_data)
# NOw combine by column, add the axis = 1 parameter
df_comb = pd.concat([df_3,df_4], axis =1)
df_comb

  First  Second  Third
0     1      33   55.0
1     2      55   99.0
2  Real  Madrid   11.0
3     4       5    NaN
4     4       6    NaN
5  Coke   Apple    NaN

# Task : Sales Data

In [22]:
# TODO: Define a df called df_sales with two columns: Date, Amount
df_sales = pd.DataFrame(columns=['Date', 'Amount'])

# TODO: Add sample data: 3 rows
data = {'Date':['02/04/2024', '44/24/3424','23/55/3225'], 
        'Amount':[345,436,366]}
# TODO: Create new df with two more rows of data, same columns as df_sales
df_sales = pd.DataFrame(data)
df_sales
# TODO: Combine them , and make sure index are correct
# TODO: Add a new column called : 'Product' with 4 rows of data, and combine it to original df_sales

         Date  Amount
0  02/04/2024     345
1  44/24/3424     436
2  23/55/3225     366

In [23]:
df_sales2 = pd.DataFrame({'Date':['23/45/2233', '33/22/3522'], 'Amount':[553,355]})
df_sales2

         Date  Amount
0  23/45/2233     553
1  33/22/3522     355

In [26]:
df_sales3 = pd.concat([df_sales,df_sales2] )
print(df_sales3)
df_sales3.reset_index(drop=True, inplace=True)
print(df_sales3)

         Date  Amount
0  02/04/2024     345
1  44/24/3424     436
2  23/55/3225     366
0  23/45/2233     553
1  33/22/3522     355
         Date  Amount
0  02/04/2024     345
1  44/24/3424     436
2  23/55/3225     366
3  23/45/2233     553
4  33/22/3522     355

In [27]:
new_column = pd.DataFrame({'Product':['A','B','C']})
df_sales3["Products"] = new_column
df_sales3

         Date  Amount Products
0  02/04/2024     345        A
1  44/24/3424     436        B
2  23/55/3225     366        C
3  23/45/2233     553      NaN
4  33/22/3522     355      NaN